inputs/templates/molokai/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               10;
    Hs                  3;
    Tp                  7;
    gamma               3.3;
    depth               10;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
2.07955e-09
2.16232e-07
7.61804e-06
0.00011978
0.00102538
0.0055262
0.0208743
0.0598749
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.066666
0.0701848
0.073696
0.0771923
0.0806661
0.08411
0.0875167
0.0908789
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        2.77162e-05
        0.000165856
        0.000667395
        0.00199451
        0.00475006
        0.00948358
        0.0164771
        0.0256292
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0684254
        0.0719404
        0.0754442
        0.0789292
        0.082388
        0.0858134
        0.0891978
        0.0925342
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0448184 0 0)
        (0.0472831 0 0)
        (0.0497655 0 0)
        (0.0522615 0 0)
        (0.0547669 0 0)
        (0.0572771 0 0)
        (0.0597875 0 0)
        (0.0622931 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.066666;
        upperFrequencyCutoff 0.6;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 100 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               10;
}



// ************************************************************************* //
